
/**
 * Пошукова форма
 */
class SearchResultView{
    constructor(options) {
        super(options);

        //ToDo: ініціалізувати елементи DOM та event listeners
//        ориентируясь на пример сайдбара
//        сначала получаем данные из формы поиска
//        данные в eventData
//        делаем публикацию на поиск из полученных данных
//        подписываемся на него и отправляем запрос на сервер
    }

    /**
     * Оновлює DOM відповідно до моделі Movies
     */
    render(){
        //ToDo: реалізація
//        из полученных данных отрисовываем карточки с 
//        совпавшими данными
//        например при вбиваении в поиск Star
//        должно быть как минимум 2 результата поиска
//        Star Wars, Star Trek
//        и так далее
    }
}
export {SearchResultView}
